
#include <iostream> // библеотечный файл
#include <string>
using namespace std;

int main()
{
    string name; // объявление строковой переменной
    cout << "What is your name? "; // вывод на экран запрос имени
    getline(cin, name); // cin читает поток данных до ближайшего разделителя,
    // метод getline - всю строчку целиком.
    cout << "Hello, " << name << "!\n"; // вывод на экран приветсвия
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
